     A                                      UNIQUE
     A          R TYPEREC
     A            TYPECODE       2A         TEXT('TYPE CODE')
     A            TYPEDESC      20A         TEXT('TYPE DESCRIPTION')
     A          K TYPECODE
